app/Helpers/count_helper.php

SELECT COUNT(*) AS `numrows`
FROM `cart`
WHERE `user_id` = '3'
---
    function countCart()
    {
        $cartModel = new CartModel();
        $user_id = session()->get('id_customer');

        if (!$user_id) {
            return 0;
        }

        return $cartModel->where('user_id', $user_id)->countAllResults();