app/Controllers/ManageKategoriProductController.php

SELECT *
FROM `kategori_product`
---
    public function index()
    {
        $data = [

            'categories' => $this->kategoriProductModel->findAll(),