app/Models/AdminModel.php

    public function getUser($usnEmail, $type = 'username')
    {
        return $this->select('id_admin, id_level, full_name, username, email, password, gender, group_name, url_image, status_registrasi')
                    ->where($type, $usnEmail)
                    ->first();
---
SELECT `id_admin`, `id_level`, `full_name`, `username`, `email`, `password`, `gender`, `group_name`, `url_image`, `status_registrasi`
FROM `admin`
WHERE `username` = 'anurmustakim'
 LIMIT 1