app/Models/OrderProductSiswaModel.php

    public function getTransactionsWithDetails() {//AMBIL DNGN TANPA ID
        return $this->db->table('transaksi_siswa')
            ->select('
                transaksi_siswa.*,
                product_siswa.product_name,
                admin.full_name as admin_name,
                customer.username as customer_name,
                customer.saldo, customer.no_telp, customer.email
            ')
            ->join('product_siswa', 'product_siswa.id_product = transaksi_siswa.id_product')
            ->join('admin', 'admin.id_admin = transaksi_siswa.id_admin')
            ->join('customer', 'customer.id_customer = transaksi_siswa.id_customer')
            ->get()
            ->getResultArray();
---
SELECT `transaksi_siswa`.*, `product_siswa`.`product_name`, `admin`.`full_name` as `admin_name`, `customer`.`username` as `customer_name`, `customer`.`saldo`, `customer`.`no_telp`, `customer`.`email`
FROM `transaksi_siswa`
JOIN `product_siswa` ON `product_siswa`.`id_product` = `transaksi_siswa`.`id_product`
JOIN `admin` ON `admin`.`id_admin` = `transaksi_siswa`.`id_admin`
JOIN `customer` ON `customer`.`id_customer` = `transaksi_siswa`.`id_customer`