app/Models/SiswaModel.php

    public function getSiswaWithGroupAndKelas()
    {
        return $this->db->table('siswa')
            ->select('siswa.*, admin.group_name, kelas.nama as kelas, admin.full_name as nama_admin') // Ambil group_name dari admin dan nama kelas dari kelas
            ->join('admin', 'admin.id_admin = siswa.id_admin', 'left') // Join dengan tabel admin
            ->join('kelas', 'kelas.id_kelas = siswa.id_kelas', 'left') // Join dengan tabel kelas
            ->get()
            ->getResultArray();
---
SELECT `siswa`.*, `admin`.`group_name`, `kelas`.`nama` as `kelas`, `admin`.`full_name` as `nama_admin`
FROM `siswa`
LEFT JOIN `admin` ON `admin`.`id_admin` = `siswa`.`id_admin`
LEFT JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`