app/Models/UrlImageProductSiswaModel.php

    public function getImagesByProductId($id_product)
    {
        return $this->db->table('url_image_product_siswa')
            ->where('id_product', $id_product)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `url_image_product_siswa`
WHERE `id_product` = '1'